In [2]:
import pandas as pd

In [6]:
df = pd.read_csv("https://raw.githubusercontent.com/sandeepmj/datasets/main/student-loan-data-comparable-quarters.csv")
df

,OPE ID,School,State,zip,School Type,dl_sub_#,dl_sub_$,dl_unsub_#,dl_unsub_$,academic_year,Quarter
0,100200,ALABAMA AGRICULTURAL & MECHANICAL UNIVERSITY,AL,35762,Public,1784.0,3800011.0,1696.0,2827818.0,2021-2022,1
1,100300,FAULKNER UNIVERSITY,AL,36109,Private-Nonprofit,822.0,1313372.0,897.0,1239907.0,2021-2022,1
2,100400,UNIVERSITY OF MONTEVALLO,AL,35115,Public,911.0,1866171.0,1069.0,2015867.0,2021-2022,1
3,100500,ALABAMA STATE UNIVERSITY,AL,36104,Public,991.0,2229604.0,1020.0,1647129.0,2021-2022,1
4,100700,CENTRAL ALABAMA COMMUNITY COLLEGE,AL,35010,Public,161.0,288345.0,69.0,102226.0,2021-2022,1
...,...,...,...,...,...,...,...,...,...,...,...
8609,4298800,SALON PROFESSIONAL ACADEMY (THE),NJ,7731,Proprietary,14.0,19828.0,15.0,18578.0,2022-2023,1
8610,4300500,TOP OF THE LINE BARBER SCHOOL,TX,78218,Proprietary,4.0,7000.0,4.0,10000.0,2022-2023,1
8611,4302900,BARBERS TRADE SCHOOL,TX,77701,Proprietary,5.0,8750.0,5.0,13000.0,2022-2023,1
8612,4303000,ACADEMIA MEDICAL INSTITUTE,OH,43204,Proprietary,15.0,24962.0,15.0,13877.0,2022-2023,1
8613,4304600,LEGENDS BARBER COLLEGE,TX,75904,Proprietary,5.0,8750.0,5.0,9225.0,2022-2023,1

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8614 entries, 0 to 8613
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   OPE ID         8614 non-null   int64
 1   School         8614 non-null   object
 2   State          8251 non-null   object
 3   zip            8614 non-null   object
 4   School Type    8614 non-null   object
 5   dl_sub_#       7972 non-null   float64
 6   dl_sub_$       7972 non-null   float64
 7   dl_unsub_#     7975 non-null   float64
 8   dl_unsub_$     7975 non-null   float64
 9   academic_year  8614 non-null   object
 10  Quarter        8614 non-null   int64
dtypes: float64(4), int64(2), object(5)
memory usage: 740.4+ KB

In [ ]:
## dataframe.describe() Returns summary data for all columns with numerical values.
## count
## mean
## standard deviation
## minimum value
## 25th, 50th and 75th percentiles
## maximum value

In [9]:
df.describe()

,OPE ID,dl_sub_#,dl_sub_$,dl_unsub_#,dl_unsub_$,Quarter
count,8.614000e+03,7972.000000,7.972000e+03,7975.000000,7.975000e+03,8614.0
mean,1.630314e+06,630.836051,1.239051e+06,686.005266,1.346809e+06,1.0
std,1.558731e+06,1412.327943,2.814541e+06,1555.280596,3.127407e+06,0.0
min,1.002000e+05,1.000000,6.800000e+01,1.000000,1.420000e+02,1.0
25%,2.853250e+05,19.000000,2.814250e+04,18.000000,3.269300e+04,1.0
50%,8.447500e+05,135.500000,2.195570e+05,136.000000,2.527800e+05,1.0
75%,3.099750e+06,600.000000,1.202372e+06,660.000000,1.264352e+06,1.0
max,4.304600e+06,24266.000000,5.200398e+07,26887.000000,7.101271e+07,1.0

In [ ]:
## Reformatting the dataframe
## The number are returned as scientific notation or big numbers with many decimal places. To change the default display, we can use:
## pd.options.display.float_format = '{:,.0f}'.format - you can change this to include one or two decimal points
## PUT THIS AT THE TOP OF EVERY NOTEBOOK

In [10]:
pd.options.display.float_format = '{:,.0f}'.format

In [11]:
df.describe()

         OPE ID  dl_sub_#   dl_sub_$  dl_unsub_#  dl_unsub_$  Quarter
count     8,614     7,972      7,972       7,975       7,975    8,614
mean  1,630,314       631  1,239,051         686   1,346,809        1
std   1,558,731     1,412  2,814,541       1,555   3,127,407        0
min     100,200         1         68           1         142        1
25%     285,325        19     28,142          18      32,693        1
50%     844,750       136    219,557         136     252,780        1
75%   3,099,750       600  1,202,372         660   1,264,352        1
max   4,304,600    24,266 52,003,984      26,887  71,012,713        1

In [12]:
## what is the total $ for ALL direct subsidized loans
df["dl_sub_$"].sum()

9877712740.0

In [17]:
## get the max for total direct subsized loans
df["dl_sub_$"].max()

52003984.0

In [18]:
print(f"{df['dl_sub_$'].max():,.0f}")

52,003,984

In [14]:
## get the minimum for total direct subsized loans
df["dl_sub_$"].min()

68.0

In [ ]:
## f-string literals
## We might want to put it into sentence for our editors

In [15]:
## what is the total $ for ALL direct subsidized loans
## format with dollar sign and thousands separators, the dollar sign has to go outside the {}
## place in a nice sentence

f"The total for all direct subsidized loans in Q1 of academic years 2021-2023 \
was ${df['dl_sub_$'].sum():,.0F}"

'The total for all direct subsidized loans in Q1 of academic years 2021-2023 was $9,877,712,740'

In [19]:
## what is the mean loan amount for ALL direct subsidized loans
df["dl_sub_$"].mean()

1239050.7701956849

In [20]:
## When looking for the standard deviation, the result you get is the STD. 35% of results are on either side of it
df["dl_sub_$"].std()

2814540.8940481567

In [21]:
## This is checking for multiple columns, return the median for subsidized loans, unsubsidized loans amounts
df[["dl_sub_$", "dl_unsub_$"]].median()

dl_sub_$     219,557
dl_unsub_$   252,780
dtype: float64

In [22]:
## return the sum for subsidized loans, unsubsidized loans amounts
df[["dl_sub_$", "dl_unsub_$"]].sum()

dl_sub_$      9,877,712,740
dl_unsub_$   10,740,802,223
dtype: float64

In [24]:
## series.to_frame() Return data in an easier to read format
### return the sum for subsidized loans, unsubsidized loans amounts
## to frame
df[["dl_sub_$", "dl_unsub_$"]].sum().to_frame("Total Loan Amounts")

            Total Loan Amounts
dl_sub_$         9,877,712,740
dl_unsub_$      10,740,802,223

In [ ]:
## AFGREGATE()
## The aggregate() method is really powerful (and a time saver). It allows us to apply one or more aggregate functions to a DataFrame or a Series.
## Note that .aggregate() has an alias of .agg(). We can use them interchangeably, but agg() is far more commonly used.
## Single columns with multiple statistical summaries
## dataframe["col_1"].agg(["mean","sum"])

In [25]:
## call the dl_sub_$ as a series
df["dl_sub_$"]

0      3,800,011
1      1,313,372
2      1,866,171
3      2,229,604
4        288,345
          ...
8609      19,828
8610       7,000
8611       8,750
8612      24,962
8613       8,750
Name: dl_sub_$, Length: 8614, dtype: float64

In [26]:
## multiple aggregation single column
df[["dl_sub_$"]].agg(["sum", "median", "max" ])

            dl_sub_$
sum    9,877,712,740
median       219,557
max       52,003,984

In [27]:
## multiple aggreation to frame
df["dl_sub_$"].agg(["sum", "median", "max" ]).to_frame("Direct Subsidized Loans")

        Direct Subsidized Loans
sum               9,877,712,740
median                  219,557
max                  52,003,984

In [28]:
## create a list of target stats

target_stats = ["sum", "mean", "median", "std"]

In [29]:
type(target_stats[0])

str

In [30]:
df["dl_sub_$"].agg(target_stats).to_frame("Direct Subsidized Loans")

        Direct Subsidized Loans
sum               9,877,712,740
mean                  1,239,051
median                  219,557
std                   2,814,541

In [ ]:
## Multiple columns with multiple statistical summaries
## dataframe[["col_1", "col_2"]].agg(["mean","sum"])

In [31]:
## multiple columns
## note the double brackets because we are passing a list of columns - Automatic to frame
df[["dl_sub_$", "dl_unsub_$"]].agg(target_stats)

            dl_sub_$     dl_unsub_$
sum    9,877,712,740 10,740,802,223
mean       1,239,051      1,346,809
median       219,557        252,780
std        2,814,541      3,127,407